{"data":{"markdownRemark":{"html":"<h2>Why you many need it</h2>\n<p>Recently, we needed to embed a number of personal finance calculators in\nour customer-facing portal. Instead of building very elaborate models for the\ncalculators and spending a lot of time on implementing each one of them from\nscratch, we wanted to see which calculators users would find most interesting.\nIteration speed and testing users' interactions with many calculators and\nunderlying models was more important than building a perfect calculator or\nhaving the outputs persisted in the backend.</p>\n<p>Based on these requirements, we decided to look for tools that would help the\nbuisness team create calculators easily and quickly and keep developers focused\non more pressing development tasks. We found a website that converts\nspreadsheets with formulas into responsive and dynamic forms that can also display\nresults. Lastly, the site also allows us to download the forms as html files. And\nall of it for free (<em>which is always good for a startup</em>)!</p>\n<p>Instead of just rendering these files individually, we wanted to make them\nfeel like they were native to our app and surround them with the proper\ncontext and branding. They couldn't just look like iframes clumsily thrown onto\nthe page. That\nmeant no double scrolling in this case (where you have a scrollbar on the browser\nwindow and another one on a particular iframe or div in the DOM).\nThat's not so easy when the forms themselves would get longer or shorter in the\niframe based on the user toggling a switch or changing an answer. Also, different\ncalculators have different lengths in their iframes. Thus, no hardcoding allowed\nbecause we wanted to reuse the pages and components wrapping those calculators.</p>\n<p>You may use the following techniques if</p>\n<ol>\n<li>You're using React (though similar things may work with other frontend frameworks)</li>\n<li>You don't need to render server-side</li>\n<li>You have an html file, url on your own domain, or a url to a domain with cross-origin checking turned off</li>\n</ol>\n<p>Ok, so far so motivated...</p>\n<h2>How you can do it</h2>\n<p><a href=\"https://codepen.io/simongawlik/pen/zyJbMm\">See the codepen</a></p>","frontmatter":{"title":"Responsive Same-Domain iframe in React Component"}}},"pageContext":{"slug":"/writing/include-responsive-iframe-in-react-component/"}}