{"data":{"markdownRemark":{"html":"<p>Welcome to my blog!</p>\n<div class=\"gatsby-highlight\" data-language=\"c\"><pre class=\"language-c\"><code class=\"language-c\"><span class=\"token keyword\">int</span> <span class=\"token function\">main</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">void</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token function\">printf</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"Hello, world!\"</span><span class=\"token punctuation\">)</span>\n<span class=\"token punctuation\">}</span></code></pre></div>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">internet@earth:~$ <span class=\"token keyword\">echo</span> <span class=\"token string\">\"Hello, Simon!\"</span></code></pre></div>\n<p>I finally decided to redo my website and as part of it, I want\nto keep a written record of some of the problems I encounter in my work and personal\nprojects as well as other musings and ideas (what netizens used to call a weblog). I\nknow, I know... it's 2019 and most people don't have blogs anymore but publish\non Medium, or write something lengthy and then upload a picture of it to Instagram or\nTwitter or <code class=\"language-text\">new_social_platform_name</code>. I'll probably cross-post some things but\nmost of my posts will have a home here.</p>\n<p>I'm interested and sometimes even knowledgeable in a wide variety of topics:\nprogramming, software engineering best practices, entrepreneurship, rowing, sports physiology\nand training planning, health care more broadly, science and science fiction,\nespecially things related to space exploration, economics and finance, and I\ncan't help it... self-helpy and motivational things.</p>\n<p>In case you were wondering, this website was built with\n<a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a>. If you know React and you're interested\nin building a static site that's inexpensive to host and easy to maintain, I'd\nrecommend you take a look at the documentation. In a future post, I might give a\nquick rundown of how I put this modest website together if folks are interested.</p>","frontmatter":{"title":"First Post"}}},"pageContext":{"slug":"/writing/first-post/"}}