{"data":{"markdownRemark":{"html":"<p>Welcome to my blog!</p>\n<div class=\"gatsby-highlight\" data-language=\"c\"><pre class=\"language-c\"><code class=\"language-c\"><span class=\"token macro property\">#<span class=\"token directive keyword\">include</span> stdio.h</span>\n\n<span class=\"token keyword\">int</span> <span class=\"token function\">main</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">void</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token function\">printf</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"Hello, world!\"</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span></code></pre></div>\n<p>I finally decided to redo my website and as part of the new website, I want\nto keep a written record of some of the problems I encounter in my work and personal\nprojects as well as other musings, things I learned, and ideas (a good old weblog). I\nknow, I know... it's 2019 and most people don't have blogs anymore but publish\non Medium, or write something lengthy and then upload a picture of it to\nTwitter or Instagram or Tumblr or <code class=\"language-text\">insert_new_social_platform_name</code>. I'll\nprobably cross-post some things but most of my posts will have a home here.</p>\n<p>I'm interested in a wide variety of topics and knowledgeable in a narrow slice of that:\nprogramming, software engineering best practices, entrepreneurship, rowing, sports physiology\nand training planning, health care more broadly, science and science fiction,\nespecially things related to space exploration, economics and finance, and I\ncan't help it... self-helpy and motivational things. In case any of these things\ninterest you as well, see if you find something you like and send me a\nmessage.</p>\n<p>I'll do my best to keep old posts updated as new information becomes available but\nin some cases it may not make sense (<em>I'm looking at you, projects with\nnpm dependencies</em>). If you find inaccuracies or errors in my posts, please let\nme know and I'll fix them.</p>\n<p>In case you were wondering, this website was built with\n<a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a>. If you know React and you're interested\nin building a static site that's free to build, inexpensive to host, and easy\nto maintain, I'd recommend you take a look at the documentation. In a future\npost, I might give a quick rundown of how I put this website together if folks\nare interested.</p>","frontmatter":{"title":"First Post"}}},"pageContext":{"slug":"/writing/first-post/"}}